// ---------------------------------------------------------------------------------------------------------------------
    /*

    Shift + f10 - run
    shift + < > - выделение
    ctrl + d - копирование строки
    ctrl + < > - быстрое перемещение по коду
    ctrl + shift + < > - быстрое выделение слов
    TAB - отступы (Стандарт 4 пробела

    */
// ---------------------------------------------------------------------------------------------------------------------
    /*

    Конструкция переменной:
    [Тип] (Имя (без .,@" и тд, только буквы, _ и цифры (лучше без них))) (знак присвоение = ) (значние) (конец строки ;)
    Пример:
    int a = 10; Где int - тип, a - название переменной, = - знак присвоения, 10 - значение, ; - конец строки

    Типы данных (Переменные)
    int a; - одно целочисленное число
    float b; - число с плавающей точкой (Пример: 3.5256)
    char d; - символ (Пример: а, 5, ., и любой другой символ на клавиатуре (включая пробел))
    double g; - расширеный вариант int
    long h; - самый большой объём хранимого числа (больше double)
    short k; - целочисленное число от -32000 до 32000
    byte l; - целочисленное число от -128 до -127
    String n; - строка (Привет ,пока, Hello, world)
    boolean c; - два значния, true - истина, или 1. false - ложь, или 2.

    */
// ---------------------------------------------------------------------------------------------------------------------
    /*
    Операции

    Математические:
    + - * / %

    Сравнение:
    =      Присваивание значения
    ==     Сравнение
    !=     Неравенство
    >      Больше
    <      Меньше
    >=     Больше или равно
    <=     Меньше или равно

    */
// ---------------------------------------------------------------------------------------------------------------------